app/controllers/pins_controller.rb

  def index
    @pins = Pin.all.order("created_at DESC").paginate(:page => params[:page],:per_page=>12)
---
SELECT  "pins".* FROM "pins"  ORDER BY created_at DESC LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "pins"

  def create
    @pin = current_user.pins.build(pin_params)
    if @pin.save
---
INSERT INTO "pins" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Test 1"], ["user_id", 2], ["created_at", "2017-11-22 14:31:54.996341"], ["updated_at", "2017-11-22 14:31:54.996341"]]

  def update
    if @pin.update(pin_params)
---
UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["description", "Test 1 2"], ["updated_at", "2017-11-22 14:34:06.983964"], ["id", 4]]

  def destroy
    @pin.destroy
---
DELETE FROM "pins" WHERE "pins"."id" = ?  [["id", 1]]

    def set_pin
      @pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 4]]